linux和它的小伙伴/在Linux上限制儿童使用电脑.org
#+TITLE: 在Linux上限制儿童使用电脑
#+AUTHOR: lujun9972
#+TAGS: linux和它的小伙伴
#+DATE: [2026-04-12 六 21:00]
#+LANGUAGE:  zh-CN
#+OPTIONS:  H:6 num:nil toc:t \n:nil ::t |:t ^:nil -:nil f:t *:t <:nil

作为家长，你可能希望控制孩子使用电脑的时间——比如只能在晚上 6 点到 8 点登录，每天最多用 2 小时，超时后自动踢出。Windows 有专门的家长控制面板，而 Linux 虽然没有这样的集成工具，但它提供的原生机制完全可以实现同样的效果，而且更加灵活。

本文将介绍如何用纯 Linux 原生方案（PAM、cron、iptables 等）实现以下功能：

+ 限制允许登录的时间段
+ 限制每日累计使用时长
+ 超时警告并自动踢出
+ 限制可访问的网站
+ 限制可运行的程序

本文假设系统中已创建一个名为 =geo= 的受限用户。所有配置需要 root 权限。

* 限制允许登录的时间段

Linux 中控制用户登录时间的机制是 PAM（Pluggable Authentication Modules，可插拔认证模块）中的 =pam_time= 模块。

** 快速配置

首先，在 PAM 配置文件中启用 =pam_time.so= 。需要修改的文件取决于你使用的登录方式：

+ 控制台登录： =/etc/pam.d/login=
+ 图形界面登录： =/etc/pam.d/lightdm= 或 =/etc/pam.d/gdm=
+ SSH 登录： =/etc/pam.d/sshd=

在上述文件的 =account= 部分添加一行：

#+BEGIN_SRC shell
  account required pam_time.so
#+END_SRC

然后在 =/etc/security/time.conf= 中添加规则。该文件的格式为：

#+BEGIN_EXAMPLE
  services;ttys;users;times
#+END_EXAMPLE

各字段含义：

+ =services= :: 服务名， =*= 表示所有服务
+ =ttys= :: 终端类型， =*= 表示所有终端
+ =users= :: 用户名
+ =times= :: 时间规则

时间规则的语法比较特别：

+ =Wk= 表示工作日（周一到周五）， =Wd= 表示周末（周六、周日）， =Al= 表示每天
+ 时间格式为 =HHMM-HHMM=
+ 前面加 =!= 表示取反（"除此时段外禁止"）

例如，限制 =geo= 用户只能在每天 18:00 到 20:00 登录：

#+BEGIN_SRC shell
  *;*;geo;Al1800-2000
#+END_SRC

这行规则的意思是：对所有服务、所有终端、geo 用户，允许每天 18:00-20:00 登录（ =Al= 表示每天都适用）。注意， =pam_time= 的逻辑是：匹配到的允许登录，未匹配到则拒绝。

验证配置：在非允许时段尝试用 =geo= 账户登录，应该会看到类似 "Permission denied" 的提示。

** 原理说明

PAM 是 Linux 的可插拔认证框架，它将认证逻辑从应用程序中解耦出来。PAM 定义了四种模块类型：

+ *auth* :: 验证用户身份（如检查密码）
+ *account* :: 检查账户是否允许访问（如检查账户是否过期、是否在允许的时间段内）
+ *password* :: 管理密码更新
+ *session* :: 管理会话的创建和销毁

=pam_time= 属于 *account* 类型。它的工作时机是在用户通过了 *auth* 阶段的密码验证之后、系统创建会话之前。此时 =pam_time= 会检查当前时间是否匹配 =time.conf= 中的规则，如果不匹配则拒绝登录。

* 限制每日累计使用时长

=pam_time= 只能控制"什么时候能登录"，但无法控制"登录后能用多久"。要实现每日使用时长的累计限制，需要自己动手：记录每次登录和登出的时间，然后定期检查是否超限。

** 快速配置

整个方案由两部分组成：一个记录登录/登出时间的脚本，和一个定期检查累计时长的脚本。

*** 第一步：记录登录/登出时间

创建 =/usr/local/bin/session-logger.sh= ：

#+BEGIN_SRC shell :tangle "/sudo::/usr/local/bin/session-logger.sh"
  #!/bin/bash
  # /usr/local/bin/session-logger.sh
  # 由 pam_exec 调用，记录用户登录/登出时间

  LOGFILE="/var/log/user-sessions.log"
  TIMESTAMP=$(date '+%Y-%m-%d %H:%M:%S')
  USERNAME="$PAM_USER"
  TYPE="$PAM_TYPE"

  if [ -z "$USERNAME" ]; then
      exit 0
  fi

  case "$TYPE" in
      open_session)
          echo "LOGIN $TIMESTAMP $USERNAME" >> "$LOGFILE"
          ;;
      close_session)
          echo "LOGOUT $TIMESTAMP $USERNAME" >> "$LOGFILE"
          ;;
  esac

  exit 0
#+END_SRC

然后赋予执行权限：

#+BEGIN_SRC shell :dir /sudo::
  sudo chmod +x /usr/local/bin/session-logger.sh
  sudo touch /var/log/user-sessions.log
  sudo chmod 600 /var/log/user-sessions.log
#+END_SRC

在 PAM 配置文件（如 =/etc/pam.d/login= 、 =/etc/pam.d/lightdm= ）的 *session* 部分添加：

#+BEGIN_SRC shell
  session optional pam_exec.so /usr/local/bin/session-logger.sh
#+END_SRC

