blog/2026/04/12/在linux上限制儿童使用电脑/index.html
<!DOCTYPE html>
<html lang="zh-CN">
<head>
  <title>在Linux上限制儿童使用电脑 - 暗无天日</title>
  <meta charset="utf-8" />
  <meta http-equiv="X-UA-Compatible" content="IE=edge">
  <meta name="viewport"
        content="width=device-width, initial-scale=1, maximum-scale=5">
  <meta name="author" content="lujun9972" />
  <meta name="keywords" content="linux和它的小伙伴" />
  <meta name="theme-color" content="#FAFAF7">
  <link rel="preconnect" href="https://fonts.googleapis.com">
  <link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
  <link href="https://fonts.googleapis.com/css2?family=Cormorant+Garamond:ital,wght@0,400;0,600;0,700;1,400&family=Source+Sans+3:ital,wght@0,400;0,500;0,600;1,400&family=JetBrains+Mono:wght@400&display=swap" rel="stylesheet">
  <link rel="stylesheet" href="../../../../../media/css/org-src-fontify.css" type="text/css">
  <link rel="stylesheet" href="../../../../../media/css/kdComment.css" type="text/css">
  <link rel="stylesheet" href="../../../../../media/css/main.css" type="text/css">
  <link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/gitalk@1/dist/gitalk.css">
</head>

  <body class="container">
<header class="masthead">
  <h1 class="masthead-title"><a href="../../../../../">暗无天日</a></h1>
  <p>=============&gt;DarkSun的个人博客</p>
  <nav class="site-nav">
    <ul class="trigger">
            <li><a href="../../../../../years/">Years</a></li>
            <li><a href="../../../../../tags/">Tags</a></li>
            <li><a href="../../../../../about/">About</a></li>
            <li><a href="https://github.com/lujun9972/lujun9972.github.com">Github</a></li>
            <li><a href="../../../../../rss.xml">RSS</a></li>
    </ul>
  </nav>
  <form method="get" id="searchform" action="http://www.google.com/search">
      <input type="text" class="field" name="q" id="s" placeholder="Search...">
      <input type="hidden" name="as_sitesearch" value="lujun9972.github.io">
  </form>
</header>

<div>
<article class="post">
<h1 class="title">在Linux上限制儿童使用电脑</h1>
<div id="table-of-contents" role="doc-toc">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org3723459">限制允许登录的时间段</a>
<ul>
<li><a href="#org0dbd388">快速配置</a></li>
<li><a href="#org605ab91">原理说明</a></li>
</ul>
</li>
<li><a href="#orgde82f09">限制每日累计使用时长</a>
<ul>
<li><a href="#org74f22fc">快速配置</a>
<ul>
<li><a href="#org7e4ed5e">第一步：记录登录/登出时间</a></li>
<li><a href="#org074b137">第二步：检查累计时长</a></li>
</ul>
</li>
<li><a href="#org9785729">原理说明</a></li>
</ul>
</li>
<li><a href="#org326db24">超时警告并踢出</a>
<ul>
<li><a href="#orgb660059">多级警告策略</a></li>
<li><a href="#org3296f29">踢出用户的不同方式</a></li>
<li><a href="#org45f29d1">原理说明</a></li>
</ul>
</li>
<li><a href="#orga705411">限制可访问网站</a>
<ul>
<li><a href="#orgf019a89">方法一：DNS 级过滤</a></li>
<li><a href="#org5d7cf5a">方法二：iptables 按用户限制</a></li>
<li><a href="#orgc334eb1">原理说明</a></li>
</ul>
</li>
<li><a href="#org6dfd90f">限制可运行程序</a>
<ul>
<li><a href="#org6875866">方法一：文件权限控制</a></li>
<li><a href="#orgb41ffc5">方法二：AppArmor</a></li>
<li><a href="#org4257bf0">原理说明</a></li>
</ul>
</li>
<li><a href="#orgc5aaa81">总结</a></li>
</ul>
</div>
</div>
<p>
作为家长，你可能希望控制孩子使用电脑的时间——比如只能在晚上 6 点到 8 点登录，每天最多用 2 小时，超时后自动踢出。Windows 有专门的家长控制面板，而 Linux 虽然没有这样的集成工具，但它提供的原生机制完全可以实现同样的效果，而且更加灵活。
</p>

<p>
本文将介绍如何用纯 Linux 原生方案（PAM、cron、iptables 等）实现以下功能：
</p>

<ul class="org-ul">
<li>限制允许登录的时间段</li>
<li>限制每日累计使用时长</li>
<li>超时警告并自动踢出</li>
<li>限制可访问的网站</li>
<li>限制可运行的程序</li>
</ul>

<p>
本文假设系统中已创建一个名为 <code>geo</code> 的受限用户。所有配置需要 root 权限。
</p>

<div id="outline-container-org3723459" class="outline-2">
<h2 id="org3723459">限制允许登录的时间段</h2>
<div class="outline-text-2" id="text-org3723459">
<p>
Linux 中控制用户登录时间的机制是 PAM（Pluggable Authentication Modules，可插拔认证模块）中的 <code>pam_time</code> 模块。
</p>
</div>

<div id="outline-container-org0dbd388" class="outline-3">
<h3 id="org0dbd388">快速配置</h3>
<div class="outline-text-3" id="text-org0dbd388">
<p>
首先，在 PAM 配置文件中启用 <code>pam_time.so</code> 。需要修改的文件取决于你使用的登录方式：
</p>

<ul class="org-ul">
<li>控制台登录： <code>/etc/pam.d/login</code></li>
<li>图形界面登录： <code>/etc/pam.d/lightdm</code> 或 <code>/etc/pam.d/gdm</code></li>
<li>SSH 登录： <code>/etc/pam.d/sshd</code></li>
</ul>

<p>
在上述文件的 <code>account</code> 部分添加一行：
</p>

<div class="org-src-container">
<pre class="src src-shell">account required pam_time.so
</pre>
</div>

<p>
然后在 <code>/etc/security/time.conf</code> 中添加规则。该文件的格式为：
</p>

<pre class="example" id="orgfa034dc">
services;ttys;users;times
</pre>

<p>
各字段含义：
</p>

<dl class="org-dl">
<dt><code>services</code></dt><dd>服务名， <code>*</code> 表示所有服务</dd>
<dt><code>ttys</code></dt><dd>终端类型， <code>*</code> 表示所有终端</dd>
<dt><code>users</code></dt><dd>用户名</dd>
<dt><code>times</code></dt><dd>时间规则</dd>
</dl>

<p>
时间规则的语法比较特别：
</p>

<ul class="org-ul">
<li><code>Wk</code> 表示工作日（周一到周五）， <code>Wd</code> 表示周末（周六、周日）， <code>Al</code> 表示每天</li>
<li>时间格式为 <code>HHMM-HHMM</code></li>
<li>前面加 <code>!</code> 表示取反（"除此时段外禁止"）</li>
</ul>

<p>
例如，限制 <code>geo</code> 用户只能在每天 18:00 到 20:00 登录：
</p>

<div class="org-src-container">
<pre class="src src-shell">*;*;geo;Al1800-2000
</pre>
</div>

<p>
这行规则的意思是：对所有服务、所有终端、geo 用户，允许每天 18:00-20:00 登录（ <code>Al</code> 表示每天都适用）。注意， <code>pam_time</code> 的逻辑是：匹配到的允许登录，未匹配到则拒绝。
</p>

<p>
验证配置：在非允许时段尝试用 <code>geo</code> 账户登录，应该会看到类似 "Permission denied" 的提示。
</p>
</div>
</div>

<div id="outline-container-org605ab91" class="outline-3">
<h3 id="org605ab91">原理说明</h3>
<div class="outline-text-3" id="text-org605ab91">
<p>
PAM 是 Linux 的可插拔认证框架，它将认证逻辑从应用程序中解耦出来。PAM 定义了四种模块类型：
</p>

<dl class="org-dl">
<dt><b>auth</b></dt><dd>验证用户身份（如检查密码）</dd>
<dt><b>account</b></dt><dd>检查账户是否允许访问（如检查账户是否过期、是否在允许的时间段内）</dd>
<dt><b>password</b></dt><dd>管理密码更新</dd>
<dt><b>session</b></dt><dd>管理会话的创建和销毁</dd>
</dl>

<p>
<code>pam_time</code> 属于 <b>account</b> 类型。它的工作时机是在用户通过了 <b>auth</b> 阶段的密码验证之后、系统创建会话之前。此时 <code>pam_time</code> 会检查当前时间是否匹配 <code>time.conf</code> 中的规则，如果不匹配则拒绝登录。
</p>
</div>
</div>
</div>

<div id="outline-container-orgde82f09" class="outline-2">
<h2 id="orgde82f09">限制每日累计使用时长</h2>
<div class="outline-text-2" id="text-orgde82f09">
<p>
<code>pam_time</code> 只能控制"什么时候能登录"，但无法控制"登录后能用多久"。要实现每日使用时长的累计限制，需要自己动手：记录每次登录和登出的时间，然后定期检查是否超限。
</p>
</div>

<div id="outline-container-org74f22fc" class="outline-3">
<h3 id="org74f22fc">快速配置</h3>
<div class="outline-text-3" id="text-org74f22fc">
<p>
整个方案由两部分组成：一个记录登录/登出时间的脚本，和一个定期检查累计时长的脚本。
</p>
</div>

<div id="outline-container-org7e4ed5e" class="outline-4">
<h4 id="org7e4ed5e">第一步：记录登录/登出时间</h4>
<div class="outline-text-4" id="text-org7e4ed5e">
<p>
创建 <code>/usr/local/bin/session-logger.sh</code> ：
</p>

<div class="org-src-container">
<pre class="src src-shell"><span class="org-comment-delimiter">#</span><span class="org-comment">!/bin/</span><span class="org-keyword">bash</span><span class="org-comment">
</span><span class="org-comment-delimiter"># </span><span class="org-comment">/usr/local/bin/session-logger.sh
</span><span class="org-comment-delimiter"># </span><span class="org-comment">&#30001; pam_exec &#35843;&#29992;&#65292;&#35760;&#24405;&#29992;&#25143;&#30331;&#24405;/&#30331;&#20986;&#26102;&#38388;
</span>
<span class="org-variable-name">LOGFILE</span>=<span class="org-string">"/var/log/user-sessions.log"</span>
<span class="org-variable-name">TIMESTAMP</span>=$(<span class="org-sh-quoted-exec">date '+%Y-%m-%d %H:%M:%S'</span>)
<span class="org-variable-name">USERNAME</span>=<span class="org-string">"$PAM_USER"</span>
<span class="org-variable-name">TYPE</span>=<span class="org-string">"$PAM_TYPE"</span>

<span class="org-keyword">if</span> [ -z <span class="org-string">"$USERNAME"</span> ]; <span class="org-keyword">then</span>
    <span class="org-keyword">exit</span> 0
<span class="org-keyword">fi</span>

<span class="org-keyword">case</span> <span class="org-string">"$TYPE"</span><span class="org-keyword"> in</span>
    open_session)
        <span class="org-builtin">echo</span> <span class="org-string">"LOGIN $TIMESTAMP $USERNAME"</span> &gt;&gt; <span class="org-string">"$LOGFILE"</span>
        ;;
    close_session)
        <span class="org-builtin">echo</span> <span class="org-string">"LOGOUT $TIMESTAMP $USERNAME"</span> &gt;&gt; <span class="org-string">"$LOGFILE"</span>
        ;;
<span class="org-keyword">esac</span>

<span class="org-keyword">exit</span> 0
</pre>
</div>

<p>
然后赋予执行权限：
</p>

<div class="org-src-container">
<pre class="src src-shell">sudo chmod +x /usr/local/bin/session-logger.sh
sudo touch /var/log/user-sessions.log
sudo chmod 600 /var/log/user-sessions.log
</pre>
</div>

<p>
在 PAM 配置文件（如 <code>/etc/pam.d/login</code> 、 <code>/etc/pam.d/lightdm</code> ）的 <b>session</b> 部分添加：
</p>

<div class="org-src-container">
<pre class="src src-shell">session optional pam_exec.so /usr/local/bin/session-logger.sh
</pre>
</div>
</div>
</div>
