linux和它的小伙伴/在Linux上限制儿童使用电脑.org
*** 第二步：检查累计时长

创建 =/usr/local/bin/check-usage.sh= ：

#+BEGIN_SRC shell :tangle "/sudo::/usr/local/bin/check-usage.sh"
  #!/bin/bash
  # /usr/local/bin/check-usage.sh
  # 检查用户当日累计使用时长

  LOGFILE="/var/log/user-sessions.log"
  TODAY=$(date '+%Y-%m-%d')
  MAX_MINUTES=120  # 每天最多使用 120 分钟（2 小时）
  TARGET_USER="geo"
  LOCKFILE="/var/run/check-usage.lock"

  # 使用锁文件防止 cron 重叠执行
  exec 9>"$LOCKFILE"
  flock -n 9 || exit 0

  # 计算今日累计在线分钟数
  calculate_usage() {
      local user=$1
      local total_seconds=0
      local login_time=""

      while IFS= read -r line; do
          local action=$(echo "$line" | awk '{print $1}')
          local timestamp=$(echo "$line" | awk '{print $2, $3}')
          local username=$(echo "$line" | awk '{print $4}')

          [ "$username" != "$user" ] && continue

          case "$action" in
              LOGIN)
                  login_time="$timestamp"
                  ;;
              LOGOUT)
                  if [ -n "$login_time" ]; then
                      local login_ts=$(date -d "$login_time" '+%s')
                      local logout_ts=$(date -d "$timestamp" '+%s')
                      total_seconds=$((total_seconds + logout_ts - login_ts))
                      login_time=""
                  fi
                  ;;
          esac
      done < <(grep "$TODAY" "$LOGFILE" | grep -E "^(LOGIN|LOGOUT)")

      # 如果用户当前在线（有未配对的 LOGIN），累加到现在
      if [ -n "$login_time" ]; then
          local login_ts=$(date -d "$login_time" '+%s')
          local now_ts=$(date '+%s')
          total_seconds=$((total_seconds + now_ts - login_ts))
      fi

      echo $((total_seconds / 60))
  }

  usage=$(calculate_usage "$TARGET_USER")
  remaining=$((MAX_MINUTES - usage))

  if [ "$remaining" -le 0 ]; then
      wall "使用时间已到，系统将在 2 分钟后将 $TARGET_USER 踢出！" 2>/dev/null
      sleep 120
      pkill -u "$TARGET_USER"
      sleep 10
      pkill -u -9 "$TARGET_USER"
  elif [ "$remaining" -le 5 ]; then
      wall "$TARGET_USER 还有 $remaining 分钟的使用时间" 2>/dev/null
  fi
#+END_SRC

赋予执行权限，并创建 systemd timer 每分钟运行一次：

#+BEGIN_SRC shell :dir /sudo::
  sudo chmod +x /usr/local/bin/check-usage.sh
#+END_SRC

创建 systemd service 文件：

#+BEGIN_SRC conf :tangle "/sudo::/etc/systemd/system/check-usage.service"
  [Unit]
  Description=Check user daily usage time

  [Service]
  Type=oneshot
  ExecStart=/usr/local/bin/check-usage.sh
#+END_SRC

创建对应的 timer 文件：

#+BEGIN_SRC conf :tangle "/sudo::/etc/systemd/system/check-usage.timer"
  [Unit]
  Description=Run check-usage every minute

  [Timer]
  OnCalendar=*-*-* *:*:00
  Persistent=true

  [Install]
  WantedBy=timers.target
#+END_SRC

启用 timer：

#+BEGIN_SRC shell :dir /sudo::
  sudo systemctl daemon-reload
  sudo systemctl enable --now check-usage.timer
#+END_SRC

** 原理说明

这里用到了两个机制：

+ *PAM session 管理* :: 当用户登录成功后，PAM 会依次调用 session 类型的模块的 =open= 钩子；当用户登出时，调用 =close= 钩子。 =pam_exec.so= 会将钩子类型通过环境变量 =PAM_TYPE= （值为 =open= 或 =close= ）传递给外部脚本，同时通过 =PAM_USER= 传递用户名。

+ *systemd timer 定时任务* :: =OnCalendar=*-*-* *:*:00= 表示每分钟整点执行一次。systemd timer 是 cron 的现代替代方案，几乎所有使用 systemd 的 Linux 发行版都内置支持。它的优势包括：自动记录日志、支持依赖关系、失败后可自动重试。这个频率足够及时地检测到超时，同时不会给系统带来明显负担。

* 超时警告并踢出

上一节的脚本已经包含了基本的警告和踢出逻辑。这里再详细说明一下各个踢出手段的区别。

** 多级警告策略

实际使用中，建议采用多级警告，给孩子一个心理准备的过程：

#+BEGIN_SRC shell
  # 在 check-usage.sh 中替换警告逻辑
  usage=$(calculate_usage "$TARGET_USER")
  remaining=$((MAX_MINUTES - usage))

  if [ "$remaining" -le 0 ]; then
      # 已超时，通知并踢出
      wall "$TARGET_USER，今日使用时间已到！" 2>/dev/null
      sleep 120
      pkill -u "$TARGET_USER"
  elif [ "$remaining" -le 2 ]; then
      # 最后 2 分钟警告
      wall "$TARGET_USER，还有 $remaining 分钟，请保存工作！" 2>/dev/null
  elif [ "$remaining" -le 5 ]; then
      # 5 分钟提醒
      wall "$TARGET_USER，还有 $remaining 分钟的使用时间" 2>/dev/null
  fi
#+END_SRC

** 踢出用户的不同方式

+ *=pkill -u geo=* :: 向 geo 用户的所有进程发送 SIGTERM 信号。这是最简单的方式，但如果有进程忽略了 SIGTERM，可能无法完全清理。可以追加 =pkill -9 -u geo= 来强制结束。

+ *=loginctl terminate-session SESSION_ID=* :: 通过 systemd-logind 来终止指定的登录会话。这比 pkill 更精确，因为它能正确地清理会话资源。查看当前会话列表可以用 =loginctl list-sessions= 。

+ *=shutdown -h +2=* :: 2 分钟后关闭整个系统。这是最彻底的方式，但会影响所有用户。如果电脑是孩子独占使用的，这也是个不错的选择。

