blog/2026/04/12/在linux上限制儿童使用电脑/index.html

<div id="outline-container-org074b137" class="outline-4">
<h4 id="org074b137">第二步：检查累计时长</h4>
<div class="outline-text-4" id="text-org074b137">
<p>
创建 <code>/usr/local/bin/check-usage.sh</code> ：
</p>

<div class="org-src-container">
<pre class="src src-shell"><span class="org-comment-delimiter">#</span><span class="org-comment">!/bin/</span><span class="org-keyword">bash</span><span class="org-comment">
</span><span class="org-comment-delimiter"># </span><span class="org-comment">/usr/local/bin/check-usage.sh
</span><span class="org-comment-delimiter"># </span><span class="org-comment">&#26816;&#26597;&#29992;&#25143;&#24403;&#26085;&#32047;&#35745;&#20351;&#29992;&#26102;&#38271;
</span>
<span class="org-variable-name">LOGFILE</span>=<span class="org-string">"/var/log/user-sessions.log"</span>
<span class="org-variable-name">TODAY</span>=$(<span class="org-sh-quoted-exec">date '+%Y-%m-%d'</span>)
<span class="org-variable-name">MAX_MINUTES</span>=120  <span class="org-comment-delimiter"># </span><span class="org-comment">&#27599;&#22825;&#26368;&#22810;&#20351;&#29992; 120 &#20998;&#38047;&#65288;2 &#23567;&#26102;&#65289;
</span><span class="org-variable-name">TARGET_USER</span>=<span class="org-string">"geo"</span>
<span class="org-variable-name">LOCKFILE</span>=<span class="org-string">"/var/run/check-usage.lock"</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">&#20351;&#29992;&#38145;&#25991;&#20214;&#38450;&#27490; cron &#37325;&#21472;&#25191;&#34892;
</span><span class="org-keyword">exec</span> 9&gt;<span class="org-string">"$LOCKFILE"</span>
flock -n 9 || <span class="org-keyword">exit</span> 0

<span class="org-comment-delimiter"># </span><span class="org-comment">&#35745;&#31639;&#20170;&#26085;&#32047;&#35745;&#22312;&#32447;&#20998;&#38047;&#25968;
</span><span class="org-function-name">calculate_usage</span>() {
    <span class="org-builtin">local</span> <span class="org-variable-name">user</span>=$<span class="org-variable-name">1</span>
    <span class="org-builtin">local</span> <span class="org-variable-name">total_seconds</span>=0
    <span class="org-builtin">local</span> <span class="org-variable-name">login_time</span>=<span class="org-string">""</span>

    <span class="org-keyword">while</span> <span class="org-variable-name">IFS</span>= read -r line; <span class="org-keyword">do</span>
        <span class="org-builtin">local</span> <span class="org-variable-name">action</span>=$(<span class="org-sh-quoted-exec">echo "$line" | awk '{print $1}'</span>)
        <span class="org-builtin">local</span> <span class="org-variable-name">timestamp</span>=$(<span class="org-sh-quoted-exec">echo "$line" | awk '{print $2, $3}'</span>)
        <span class="org-builtin">local</span> <span class="org-variable-name">username</span>=$(<span class="org-sh-quoted-exec">echo "$line" | awk '{print $4}'</span>)

        [ <span class="org-string">"$username"</span> != <span class="org-string">"$user"</span> ] &amp;&amp; <span class="org-keyword">continue</span>

        <span class="org-keyword">case</span> <span class="org-string">"$action"</span><span class="org-keyword"> in</span>
            LOGIN)
                <span class="org-variable-name">login_time</span>=<span class="org-string">"$timestamp"</span>
                ;;
            LOGOUT)
                <span class="org-keyword">if</span> [ -n <span class="org-string">"$login_time"</span> ]; <span class="org-keyword">then</span>
                    <span class="org-builtin">local</span> <span class="org-variable-name">login_ts</span>=$(<span class="org-sh-quoted-exec">date -d "$login_time" '+%s'</span>)
                    <span class="org-builtin">local</span> <span class="org-variable-name">logout_ts</span>=$(<span class="org-sh-quoted-exec">date -d "$timestamp" '+%s'</span>)
                    <span class="org-variable-name">total_seconds</span>=$(<span class="org-sh-quoted-exec">(total_seconds + logout_ts - login_ts</span>))
                    <span class="org-variable-name">login_time</span>=<span class="org-string">""</span>
                <span class="org-keyword">fi</span>
                ;;
        <span class="org-keyword">esac</span>
    <span class="org-keyword">done</span> &lt; &lt;(grep <span class="org-string">"$TODAY"</span> <span class="org-string">"$LOGFILE"</span> | grep -E <span class="org-string">"^(LOGIN|LOGOUT)"</span>)

    <span class="org-comment-delimiter"># </span><span class="org-comment">&#22914;&#26524;&#29992;&#25143;&#24403;&#21069;&#22312;&#32447;&#65288;&#26377;&#26410;&#37197;&#23545;&#30340; LOGIN&#65289;&#65292;&#32047;&#21152;&#21040;&#29616;&#22312;
</span>    <span class="org-keyword">if</span> [ -n <span class="org-string">"$login_time"</span> ]; <span class="org-keyword">then</span>
        <span class="org-builtin">local</span> <span class="org-variable-name">login_ts</span>=$(<span class="org-sh-quoted-exec">date -d "$login_time" '+%s'</span>)
        <span class="org-builtin">local</span> <span class="org-variable-name">now_ts</span>=$(<span class="org-sh-quoted-exec">date '+%s'</span>)
        <span class="org-variable-name">total_seconds</span>=$(<span class="org-sh-quoted-exec">(total_seconds + now_ts - login_ts</span>))
    <span class="org-keyword">fi</span>

    <span class="org-builtin">echo</span> $(<span class="org-sh-quoted-exec">(total_seconds / 60</span>))
}

<span class="org-variable-name">usage</span>=$(<span class="org-sh-quoted-exec">calculate_usage "$TARGET_USER"</span>)
<span class="org-variable-name">remaining</span>=$(<span class="org-sh-quoted-exec">(MAX_MINUTES - usage</span>))

<span class="org-keyword">if</span> [ <span class="org-string">"$remaining"</span> -le 0 ]; <span class="org-keyword">then</span>
    wall <span class="org-string">"&#20351;&#29992;&#26102;&#38388;&#24050;&#21040;&#65292;&#31995;&#32479;&#23558;&#22312; 2 &#20998;&#38047;&#21518;&#23558; $TARGET_USER &#36386;&#20986;&#65281;"</span> 2&gt;/dev/null
    sleep 120
    pkill -u <span class="org-string">"$TARGET_USER"</span>
    sleep 10
    pkill -u -9 <span class="org-string">"$TARGET_USER"</span>
<span class="org-keyword">elif</span> [ <span class="org-string">"$remaining"</span> -le 5 ]; <span class="org-keyword">then</span>
    wall <span class="org-string">"$TARGET_USER &#36824;&#26377; $remaining &#20998;&#38047;&#30340;&#20351;&#29992;&#26102;&#38388;"</span> 2&gt;/dev/null
<span class="org-keyword">fi</span>
</pre>
</div>

<p>
赋予执行权限，并创建 systemd timer 每分钟运行一次：
</p>

<div class="org-src-container">
<pre class="src src-shell">sudo chmod +x /usr/local/bin/check-usage.sh
</pre>
</div>

<p>
创建 systemd service 文件：
</p>

<div class="org-src-container">
<pre class="src src-conf">[<span class="org-type">Unit</span>]
<span class="org-variable-name">Description</span>=Check user daily usage time

[<span class="org-type">Service</span>]
<span class="org-variable-name">Type</span>=oneshot
<span class="org-variable-name">ExecStart</span>=/usr/local/bin/check-usage.sh
</pre>
</div>

<p>
创建对应的 timer 文件：
</p>

<div class="org-src-container">
<pre class="src src-conf">[<span class="org-type">Unit</span>]
<span class="org-variable-name">Description</span>=Run check-usage every minute

[<span class="org-type">Timer</span>]
<span class="org-variable-name">OnCalendar</span>=*-*-* *:*:00
<span class="org-variable-name">Persistent</span>=true

[<span class="org-type">Install</span>]
<span class="org-variable-name">WantedBy</span>=timers.target
</pre>
</div>

<p>
启用 timer：
</p>

<div class="org-src-container">
<pre class="src src-shell">sudo systemctl daemon-reload
sudo systemctl enable --now check-usage.timer
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org9785729" class="outline-3">
<h3 id="org9785729">原理说明</h3>
<div class="outline-text-3" id="text-org9785729">
<p>
这里用到了两个机制：
</p>

<dl class="org-dl">
<dt><b>PAM session 管理</b></dt><dd>当用户登录成功后，PAM 会依次调用 session 类型的模块的 <code>open</code> 钩子；当用户登出时，调用 <code>close</code> 钩子。 <code>pam_exec.so</code> 会将钩子类型通过环境变量 <code>PAM_TYPE</code> （值为 <code>open</code> 或 <code>close</code> ）传递给外部脚本，同时通过 <code>PAM_USER</code> 传递用户名。</dd>

<dt><b>systemd timer 定时任务</b></dt><dd><code>OnCalendar=*-*-* *:*:00</code> 表示每分钟整点执行一次。systemd timer 是 cron 的现代替代方案，几乎所有使用 systemd 的 Linux 发行版都内置支持。它的优势包括：自动记录日志、支持依赖关系、失败后可自动重试。这个频率足够及时地检测到超时，同时不会给系统带来明显负担。</dd>
</dl>
</div>
</div>
</div>

<div id="outline-container-org326db24" class="outline-2">
<h2 id="org326db24">超时警告并踢出</h2>
<div class="outline-text-2" id="text-org326db24">
<p>
上一节的脚本已经包含了基本的警告和踢出逻辑。这里再详细说明一下各个踢出手段的区别。
</p>
</div>

<div id="outline-container-orgb660059" class="outline-3">
<h3 id="orgb660059">多级警告策略</h3>
<div class="outline-text-3" id="text-orgb660059">
<p>
实际使用中，建议采用多级警告，给孩子一个心理准备的过程：
</p>

<div class="org-src-container">
<pre class="src src-shell"><span class="org-comment-delimiter"># </span><span class="org-comment">&#22312; check-usage.sh &#20013;&#26367;&#25442;&#35686;&#21578;&#36923;&#36753;
</span><span class="org-variable-name">usage</span>=$(<span class="org-sh-quoted-exec">calculate_usage "$TARGET_USER"</span>)
<span class="org-variable-name">remaining</span>=$(<span class="org-sh-quoted-exec">(MAX_MINUTES - usage</span>))

<span class="org-keyword">if</span> [ <span class="org-string">"$remaining"</span> -le 0 ]; <span class="org-keyword">then</span>
    <span class="org-comment-delimiter"># </span><span class="org-comment">&#24050;&#36229;&#26102;&#65292;&#36890;&#30693;&#24182;&#36386;&#20986;
</span>    wall <span class="org-string">"$TARGET_USER&#65292;&#20170;&#26085;&#20351;&#29992;&#26102;&#38388;&#24050;&#21040;&#65281;"</span> 2&gt;/dev/null
    sleep 120
    pkill -u <span class="org-string">"$TARGET_USER"</span>
<span class="org-keyword">elif</span> [ <span class="org-string">"$remaining"</span> -le 2 ]; <span class="org-keyword">then</span>
    <span class="org-comment-delimiter"># </span><span class="org-comment">&#26368;&#21518; 2 &#20998;&#38047;&#35686;&#21578;
</span>    wall <span class="org-string">"$TARGET_USER&#65292;&#36824;&#26377; $remaining &#20998;&#38047;&#65292;&#35831;&#20445;&#23384;&#24037;&#20316;&#65281;"</span> 2&gt;/dev/null
<span class="org-keyword">elif</span> [ <span class="org-string">"$remaining"</span> -le 5 ]; <span class="org-keyword">then</span>
    <span class="org-comment-delimiter"># </span><span class="org-comment">5 &#20998;&#38047;&#25552;&#37266;
</span>    wall <span class="org-string">"$TARGET_USER&#65292;&#36824;&#26377; $remaining &#20998;&#38047;&#30340;&#20351;&#29992;&#26102;&#38388;"</span> 2&gt;/dev/null
<span class="org-keyword">fi</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org3296f29" class="outline-3">
<h3 id="org3296f29">踢出用户的不同方式</h3>
<div class="outline-text-3" id="text-org3296f29">
<dl class="org-dl">
<dt><b><code>pkill -u geo</code></b></dt><dd>向 geo 用户的所有进程发送 SIGTERM 信号。这是最简单的方式，但如果有进程忽略了 SIGTERM，可能无法完全清理。可以追加 <code>pkill -9 -u geo</code> 来强制结束。</dd>

<dt><b><code>loginctl terminate-session SESSION_ID</code></b></dt><dd>通过 systemd-logind 来终止指定的登录会话。这比 pkill 更精确，因为它能正确地清理会话资源。查看当前会话列表可以用 <code>loginctl list-sessions</code> 。</dd>

<dt><b><code>shutdown -h +2</code></b></dt><dd>2 分钟后关闭整个系统。这是最彻底的方式，但会影响所有用户。如果电脑是孩子独占使用的，这也是个不错的选择。</dd>
</dl>
</div>
</div>
