linux和它的小伙伴/在Linux上限制儿童使用电脑.org
** 原理说明

=wall= 命令的工作原理是向系统中所有终端设备（ =/dev/pts/*= 和 =/dev/tty*= ）写入消息。只有拥有终端的登录用户才能看到消息。

=pkill= 通过匹配进程的 UID 来选择目标进程，先发送 SIGTERM（信号 15），允许进程优雅退出。如果进程不响应，可以发送 SIGKILL（信号 9）强制终止。

=loginctl= 是 systemd-logind 的命令行接口。logind 作为 systemd 的用户登录管理器，跟踪系统中所有的登录会话（包括图形和终端会话）。 =terminate-session= 会向会话中的所有进程发送终止信号，并清理会话资源。

* 限制可访问网站

在 HTTPS 普及的今天，我们无法在不安装额外证书的情况下检查 HTTP 请求的内容。因此 Linux 原生方案只能在 IP 和域名级别进行过滤。下面介绍两种方法。

** 方法一：DNS 级过滤

通过配置本地 DNS 服务器 =dnsmasq= ，将不希望访问的域名解析到无效地址。

首先安装 =dnsmasq= ：

#+BEGIN_SRC shell :dir /sudo::
  sudo pacman -S dnsmasq  # Arch Linux
#+END_SRC

创建黑名单文件 =/etc/blocked-hosts= ：

#+BEGIN_EXAMPLE
  # /etc/blocked-hosts
  # 每行一个要屏蔽的域名
  example-bad-site.com
  another-bad-site.com
#+END_EXAMPLE

在 =/etc/dnsmasq.conf= 中添加配置：

#+BEGIN_SRC shell
  # 将黑名单中的域名解析到 127.0.0.1
  addn-hosts=/etc/blocked-hosts
#+END_SRC

然后启动 dnsmasq 并将系统 DNS 指向本地：

#+BEGIN_SRC shell :dir /sudo::
  sudo systemctl enable --now dnsmasq
  # 修改 /etc/resolv.conf
  echo "nameserver 127.0.0.1" | sudo tee /etc/resolv.conf
#+END_SRC

这种方法的缺点是：只要孩子知道如何修改 DNS 设置，就能轻松绕过。

** 方法二：iptables 按用户限制

=iptables= 的 =owner= 模块可以根据进程的 UID 来匹配网络流量， =time= 模块可以按时间段匹配。两者结合，可以限制特定用户在特定时间段内的网络访问。

#+BEGIN_SRC shell :dir /sudo::
  # 允许 geo 用户在 18:00-20:00 访问网络
  sudo iptables -A OUTPUT -m owner --uid-owner geo -m time --timestart 18:00 --timestop 20:00 -j ACCEPT

  # 禁止 geo 用户在其他时间访问网络
  sudo iptables -A OUTPUT -m owner --uid-owner geo -j DROP
#+END_SRC

要持久化这些规则，可以将它们写入一个规则文件，然后在启动时自动恢复：

#+BEGIN_SRC shell :tangle "/sudo::/etc/iptables/parental-control.rules"
  # /etc/iptables/parental-control.rules
  *filter
  :OUTPUT ACCEPT [0:0]
  -A OUTPUT -m owner --uid-owner geo -m time --timestart 18:00 --timestop 20:00 -j ACCEPT
  -A OUTPUT -m owner --uid-owner geo -j DROP
  COMMIT
#+END_SRC

恢复规则：

#+BEGIN_SRC shell :dir /sudo::
  sudo iptables-restore < /etc/iptables/parental-control.rules
#+END_SRC

** 原理说明

Linux 的网络过滤由 Netfilter 框架实现。Netfilter 在网络协议栈中设置了五个钩子点：

+ *PREROUTING* :: 数据包进入路由之前
+ *INPUT* :: 数据包发往本机进程之前
+ *FORWARD* :: 数据包转发到其他接口之前
+ *OUTPUT* :: 本机进程发出的数据包
+ *POSTROUTING* :: 数据包发出之前

我们使用的是 *OUTPUT* 链，它处理本机进程发出的所有数据包。 =owner= 模块通过检查数据包对应的 socket 的 UID 来匹配， =time= 模块通过系统时间来匹配。规则从上到下依次匹配，匹配到后就执行指定的动作（ =ACCEPT= 或 =DROP= ）。

* 限制可运行程序

不想让孩子玩某些游戏或使用某些软件？最直接的方法是通过 Linux 的权限系统来限制。

** 方法一：文件权限控制

Linux 的每个文件都有三组权限：所有者（owner）、所属组（group）、其他人（others）。我们可以利用这个机制来限制特定用户执行特定程序。

假设要禁止 =geo= 用户运行 =steam= ：

#+BEGIN_SRC shell :dir /sudo::
  # 创建受限组
  sudo groupadd restricted

  # 将 steam 的组改为 restricted，权限设为 750
  sudo chgrp restricted /usr/bin/steam
  sudo chmod 750 /usr/bin/steam

  # 确保 geo 不在 restricted 组中
  sudo gpasswd -d geo restricted 2>/dev/null || true
#+END_SRC

这样，只有 root 用户和 restricted 组的成员可以运行 =steam= ，而 =geo= 用户会得到 "Permission denied" 的错误。

对于需要限制的每个程序，重复上述步骤即可。也可以写一个脚本来批量处理：

#+BEGIN_SRC shell 
  #!/bin/bash
  # /usr/local/bin/restrict-programs.sh
  # 限制指定程序只能由 restricted 组执行

  PROGRAMS="/usr/bin/steam /usr/bin/wine /usr/bin/discord"

  for prog in $PROGRAMS; do
      if [ -f "$prog" ]; then
          sudo chgrp restricted "$prog"
          sudo chmod 750 "$prog"
          echo "Restricted: $prog"
      fi
  done
#+END_SRC

需要注意：当软件包更新时，权限可能会被重置。可以将这个脚本放在 systemd 的 timer 或 pacman 的 hook 中定期执行。

** 方法二：AppArmor

AppArmor 提供了更强大的强制访问控制（MAC）。与文件权限不同，AppArmor 的策略无法被用户（包括文件所有者）修改。

在 Arch Linux 上安装并启用 AppArmor：

#+BEGIN_SRC shell :dir /sudo::
  sudo pacman -S apparmor
  sudo systemctl enable --now apparmor
#+END_SRC

AppArmor 通过 profile 来定义程序的访问权限。需要注意的是，AppArmor 的 profile 是绑定到程序的，不能直接按用户限制。要实现按用户限制，需要配合 =pam_apparmor= 模块，在用户登录时为不同用户加载不同的 profile。

首先，创建一个限制性的 profile：

#+BEGIN_EXAMPLE
  # /etc/apparmor.d/restrict-geo-steam
  abi <abi/4.0>,
  include <tunables/global>

  /usr/bin/steam {
      include <abstractions/base>

      # 只允许特定用户组执行
      # 注意：AppArmor 本身不直接支持按用户过滤，
      # 这里通过 owner 匹配来限制只有文件所有者可以执行
      owner /usr/bin/steam r,
  }
#+END_EXAMPLE

如果需要更精确的按用户控制，建议结合文件权限方法使用——将程序的组设为受限组，然后在 AppArmor profile 中限制该组的访问。或者使用 =pam_apparmor= 在用户登录时动态加载不同的 profile。

加载 profile：

#+BEGIN_SRC shell :dir /sudo::
  sudo apparmor_parser -r /etc/apparmor.d/restrict-geo-steam
#+END_SRC

** 原理说明

+ *DAC（自主访问控制）* :: Linux 默认的权限模型。每个文件有三组权限位（读 r、写 w、执行 x），分别对应所有者、所属组、其他人。文件的所有者可以自主修改文件的权限。"自主"的含义就在于此——权限由所有者决定。

+ *MAC（强制访问控制）* :: AppArmor 实现的权限模型。策略由系统管理员定义，普通用户无法绕过或修改。AppArmor 使用基于路径的匹配（而非 SELinux 的基于标签的匹配），配置相对简单。

