blog/2026/04/12/在linux上限制儿童使用电脑/index.html

<div id="outline-container-org45f29d1" class="outline-3">
<h3 id="org45f29d1">原理说明</h3>
<div class="outline-text-3" id="text-org45f29d1">
<p>
<code>wall</code> 命令的工作原理是向系统中所有终端设备（ <code>/dev/pts/*</code> 和 <code>/dev/tty*</code> ）写入消息。只有拥有终端的登录用户才能看到消息。
</p>

<p>
<code>pkill</code> 通过匹配进程的 UID 来选择目标进程，先发送 SIGTERM（信号 15），允许进程优雅退出。如果进程不响应，可以发送 SIGKILL（信号 9）强制终止。
</p>

<p>
<code>loginctl</code> 是 systemd-logind 的命令行接口。logind 作为 systemd 的用户登录管理器，跟踪系统中所有的登录会话（包括图形和终端会话）。 <code>terminate-session</code> 会向会话中的所有进程发送终止信号，并清理会话资源。
</p>
</div>
</div>
</div>

<div id="outline-container-orga705411" class="outline-2">
<h2 id="orga705411">限制可访问网站</h2>
<div class="outline-text-2" id="text-orga705411">
<p>
在 HTTPS 普及的今天，我们无法在不安装额外证书的情况下检查 HTTP 请求的内容。因此 Linux 原生方案只能在 IP 和域名级别进行过滤。下面介绍两种方法。
</p>
</div>

<div id="outline-container-orgf019a89" class="outline-3">
<h3 id="orgf019a89">方法一：DNS 级过滤</h3>
<div class="outline-text-3" id="text-orgf019a89">
<p>
通过配置本地 DNS 服务器 <code>dnsmasq</code> ，将不希望访问的域名解析到无效地址。
</p>

<p>
首先安装 <code>dnsmasq</code> ：
</p>

<div class="org-src-container">
<pre class="src src-shell">sudo pacman -S dnsmasq  <span class="org-comment-delimiter"># </span><span class="org-comment">Arch Linux</span>
</pre>
</div>

<p>
创建黑名单文件 <code>/etc/blocked-hosts</code> ：
</p>

<pre class="example" id="org4295e08">
# /etc/blocked-hosts
# 每行一个要屏蔽的域名
example-bad-site.com
another-bad-site.com
</pre>

<p>
在 <code>/etc/dnsmasq.conf</code> 中添加配置：
</p>

<div class="org-src-container">
<pre class="src src-shell"><span class="org-comment-delimiter"># </span><span class="org-comment">&#23558;&#40657;&#21517;&#21333;&#20013;&#30340;&#22495;&#21517;&#35299;&#26512;&#21040; 127.0.0.1
</span>addn-hosts=/etc/blocked-hosts
</pre>
</div>

<p>
然后启动 dnsmasq 并将系统 DNS 指向本地：
</p>

<div class="org-src-container">
<pre class="src src-shell">sudo systemctl enable --now dnsmasq
<span class="org-comment-delimiter"># </span><span class="org-comment">&#20462;&#25913; /etc/resolv.conf
</span><span class="org-builtin">echo</span> <span class="org-string">"nameserver 127.0.0.1"</span> | sudo tee /etc/resolv.conf
</pre>
</div>

<p>
这种方法的缺点是：只要孩子知道如何修改 DNS 设置，就能轻松绕过。
</p>
</div>
</div>

<div id="outline-container-org5d7cf5a" class="outline-3">
<h3 id="org5d7cf5a">方法二：iptables 按用户限制</h3>
<div class="outline-text-3" id="text-org5d7cf5a">
<p>
<code>iptables</code> 的 <code>owner</code> 模块可以根据进程的 UID 来匹配网络流量， <code>time</code> 模块可以按时间段匹配。两者结合，可以限制特定用户在特定时间段内的网络访问。
</p>

<div class="org-src-container">
<pre class="src src-shell"><span class="org-comment-delimiter"># </span><span class="org-comment">&#20801;&#35768; geo &#29992;&#25143;&#22312; 18:00-20:00 &#35775;&#38382;&#32593;&#32476;
</span>sudo iptables -A OUTPUT -m owner --uid-owner geo -m time --timestart 18:00 --timestop 20:00 -j ACCEPT

<span class="org-comment-delimiter"># </span><span class="org-comment">&#31105;&#27490; geo &#29992;&#25143;&#22312;&#20854;&#20182;&#26102;&#38388;&#35775;&#38382;&#32593;&#32476;
</span>sudo iptables -A OUTPUT -m owner --uid-owner geo -j DROP
</pre>
</div>

<p>
要持久化这些规则，可以将它们写入一个规则文件，然后在启动时自动恢复：
</p>

<div class="org-src-container">
<pre class="src src-shell"><span class="org-comment-delimiter"># </span><span class="org-comment">/etc/iptables/parental-control.rules
</span>*filter
:OUTPUT ACCEPT [0:0]
-A OUTPUT -m owner --uid-owner geo -m time --timestart 18:00 --timestop 20:00 -j ACCEPT
-A OUTPUT -m owner --uid-owner geo -j DROP
COMMIT
</pre>
</div>

<p>
恢复规则：
</p>

<div class="org-src-container">
<pre class="src src-shell">sudo iptables-restore &lt; /etc/iptables/parental-control.rules
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc334eb1" class="outline-3">
<h3 id="orgc334eb1">原理说明</h3>
<div class="outline-text-3" id="text-orgc334eb1">
<p>
Linux 的网络过滤由 Netfilter 框架实现。Netfilter 在网络协议栈中设置了五个钩子点：
</p>

<dl class="org-dl">
<dt><b>PREROUTING</b></dt><dd>数据包进入路由之前</dd>
<dt><b>INPUT</b></dt><dd>数据包发往本机进程之前</dd>
<dt><b>FORWARD</b></dt><dd>数据包转发到其他接口之前</dd>
<dt><b>OUTPUT</b></dt><dd>本机进程发出的数据包</dd>
<dt><b>POSTROUTING</b></dt><dd>数据包发出之前</dd>
</dl>

<p>
我们使用的是 <b>OUTPUT</b> 链，它处理本机进程发出的所有数据包。 <code>owner</code> 模块通过检查数据包对应的 socket 的 UID 来匹配， <code>time</code> 模块通过系统时间来匹配。规则从上到下依次匹配，匹配到后就执行指定的动作（ <code>ACCEPT</code> 或 <code>DROP</code> ）。
</p>
</div>
</div>
</div>

<div id="outline-container-org6dfd90f" class="outline-2">
<h2 id="org6dfd90f">限制可运行程序</h2>
<div class="outline-text-2" id="text-org6dfd90f">
<p>
不想让孩子玩某些游戏或使用某些软件？最直接的方法是通过 Linux 的权限系统来限制。
</p>
</div>

<div id="outline-container-org6875866" class="outline-3">
<h3 id="org6875866">方法一：文件权限控制</h3>
<div class="outline-text-3" id="text-org6875866">
<p>
Linux 的每个文件都有三组权限：所有者（owner）、所属组（group）、其他人（others）。我们可以利用这个机制来限制特定用户执行特定程序。
</p>

<p>
假设要禁止 <code>geo</code> 用户运行 <code>steam</code> ：
</p>

<div class="org-src-container">
<pre class="src src-shell"><span class="org-comment-delimiter"># </span><span class="org-comment">&#21019;&#24314;&#21463;&#38480;&#32452;
</span>sudo groupadd restricted

<span class="org-comment-delimiter"># </span><span class="org-comment">&#23558; steam &#30340;&#32452;&#25913;&#20026; restricted&#65292;&#26435;&#38480;&#35774;&#20026; 750
</span>sudo chgrp restricted /usr/bin/steam
sudo chmod 750 /usr/bin/steam

<span class="org-comment-delimiter"># </span><span class="org-comment">&#30830;&#20445; geo &#19981;&#22312; restricted &#32452;&#20013;
</span>sudo gpasswd -d geo restricted 2&gt;/dev/null || true
</pre>
</div>

<p>
这样，只有 root 用户和 restricted 组的成员可以运行 <code>steam</code> ，而 <code>geo</code> 用户会得到 "Permission denied" 的错误。
</p>

<p>
对于需要限制的每个程序，重复上述步骤即可。也可以写一个脚本来批量处理：
</p>

<div class="org-src-container">
<pre class="src src-shell"><span class="org-comment-delimiter">#</span><span class="org-comment">!/bin/</span><span class="org-keyword">bash</span><span class="org-comment">
</span><span class="org-comment-delimiter"># </span><span class="org-comment">/usr/local/bin/restrict-programs.sh
</span><span class="org-comment-delimiter"># </span><span class="org-comment">&#38480;&#21046;&#25351;&#23450;&#31243;&#24207;&#21482;&#33021;&#30001; restricted &#32452;&#25191;&#34892;
</span>
<span class="org-variable-name">PROGRAMS</span>=<span class="org-string">"/usr/bin/steam /usr/bin/wine /usr/bin/discord"</span>

<span class="org-keyword">for</span> prog<span class="org-keyword"> in</span> $<span class="org-variable-name">PROGRAMS</span>; <span class="org-keyword">do</span>
    <span class="org-keyword">if</span> [ -f <span class="org-string">"$prog"</span> ]; <span class="org-keyword">then</span>
        sudo chgrp restricted <span class="org-string">"$prog"</span>
        sudo chmod 750 <span class="org-string">"$prog"</span>
        <span class="org-builtin">echo</span> <span class="org-string">"Restricted: $prog"</span>
    <span class="org-keyword">fi</span>
<span class="org-keyword">done</span>
</pre>
</div>

<p>
需要注意：当软件包更新时，权限可能会被重置。可以将这个脚本放在 systemd 的 timer 或 pacman 的 hook 中定期执行。
</p>
</div>
</div>

<div id="outline-container-orgb41ffc5" class="outline-3">
<h3 id="orgb41ffc5">方法二：AppArmor</h3>
<div class="outline-text-3" id="text-orgb41ffc5">
<p>
AppArmor 提供了更强大的强制访问控制（MAC）。与文件权限不同，AppArmor 的策略无法被用户（包括文件所有者）修改。
</p>

<p>
在 Arch Linux 上安装并启用 AppArmor：
</p>

<div class="org-src-container">
<pre class="src src-shell">sudo pacman -S apparmor
sudo systemctl enable --now apparmor
</pre>
</div>

<p>
AppArmor 通过 profile 来定义程序的访问权限。需要注意的是，AppArmor 的 profile 是绑定到程序的，不能直接按用户限制。要实现按用户限制，需要配合 <code>pam_apparmor</code> 模块，在用户登录时为不同用户加载不同的 profile。
</p>

<p>
首先，创建一个限制性的 profile：
</p>

<pre class="example" id="orgae44a51">
# /etc/apparmor.d/restrict-geo-steam
abi &lt;abi/4.0&gt;,
include &lt;tunables/global&gt;

/usr/bin/steam {
    include &lt;abstractions/base&gt;

    # 只允许特定用户组执行
    # 注意：AppArmor 本身不直接支持按用户过滤，
    # 这里通过 owner 匹配来限制只有文件所有者可以执行
    owner /usr/bin/steam r,
}
</pre>

<p>
如果需要更精确的按用户控制，建议结合文件权限方法使用——将程序的组设为受限组，然后在 AppArmor profile 中限制该组的访问。或者使用 <code>pam_apparmor</code> 在用户登录时动态加载不同的 profile。
</p>

<p>
加载 profile：
</p>

<div class="org-src-container">
<pre class="src src-shell">sudo apparmor_parser -r /etc/apparmor.d/restrict-geo-steam
</pre>
</div>
</div>
</div>

<div id="outline-container-org4257bf0" class="outline-3">
<h3 id="org4257bf0">原理说明</h3>
<div class="outline-text-3" id="text-org4257bf0">
<dl class="org-dl">
<dt><b>DAC（自主访问控制）</b></dt><dd>Linux 默认的权限模型。每个文件有三组权限位（读 r、写 w、执行 x），分别对应所有者、所属组、其他人。文件的所有者可以自主修改文件的权限。"自主"的含义就在于此——权限由所有者决定。</dd>

<dt><b>MAC（强制访问控制）</b></dt><dd>AppArmor 实现的权限模型。策略由系统管理员定义，普通用户无法绕过或修改。AppArmor 使用基于路径的匹配（而非 SELinux 的基于标签的匹配），配置相对简单。</dd>
</dl>
</div>
</div>
</div>
